#### Terraform Format and Style 🖌`success`
#### "" - Terraform Initialization ⚙️`success`
#### "" - Terraform Validation 🤖Success! The configuration is valid.


#### "" - Terraform Plan 📖`success`

<details><summary>"" - Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.core-infrastructure.module.k8s-master.data.google_container_engine_versions.cluster_versions: Refreshing state... [id=2020-11-04 19:14:59.0022029 +0000 UTC]
module.core-infrastructure.module.k8s-master.data.google_project.project: Refreshing state... [id=projects/broad-jade-ms]
module.enable-services.google_project_service.serviceusage[0]: Refreshing state... [id=broad-jade-ms/serviceusage.googleapis.com]
module.enable-services.google_project_service.cloudresourcemanager[0]: Refreshing state... [id=broad-jade-ms/cloudresourcemanager.googleapis.com]
module.core-infrastructure.google_compute_ssl_policy.global-ssl-policy: Refreshing state... [id=projects/broad-jade-ms/global/sslPolicies/global-ssl-policy]
module.core-infrastructure.module.cloud-armor.google_compute_security_policy.policy: Refreshing state... [id=projects/broad-jade-ms/global/securityPolicies/broad-cloud-armor]
module.datarepo-app.module.cloudsql.random_id.root_user_password[0]: Refreshing state... [id=yLeZ7i72V2asjgB9a745iw]
module.datarepo-app.module.cloudsql.random_id.app_user_password["datarepo"]: Refreshing state... [id=R1-vydyEonKftrcsE98QbA]
module.datarepo-app.module.cloudsql.random_id.cloudsql_id[0]: Refreshing state... [id=4UaRTS9ENMc]
module.datarepo-app.module.cloudsql.random_id.app_user_password["datarepo-stairway"]: Refreshing state... [id=KvmEUqcfmTGmfjEwsOqy-w]
module.enable-services.google_project_service.required-services[11]: Refreshing state... [id=broad-jade-ms/storage-api.googleapis.com]
module.enable-services.google_project_service.required-services[1]: Refreshing state... [id=broad-jade-ms/cloudresourcemanager.googleapis.com]
module.enable-services.google_project_service.required-services[3]: Refreshing state... [id=broad-jade-ms/genomics.googleapis.com]
module.enable-services.google_project_service.required-services[8]: Refreshing state... [id=broad-jade-ms/monitoring.googleapis.com]
module.enable-services.google_project_service.required-services[2]: Refreshing state... [id=broad-jade-ms/serviceusage.googleapis.com]
module.enable-services.google_project_service.required-services[13]: Refreshing state... [id=broad-jade-ms/servicenetworking.googleapis.com]
module.enable-services.google_project_service.required-services[4]: Refreshing state... [id=broad-jade-ms/compute.googleapis.com]
module.enable-services.google_project_service.required-services[9]: Refreshing state... [id=broad-jade-ms/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[0]: Refreshing state... [id=broad-jade-ms/iamcredentials.googleapis.com]
module.enable-services.google_project_service.required-services[15]: Refreshing state... [id=broad-jade-ms/logging.googleapis.com]
module.enable-services.google_project_service.required-services[10]: Refreshing state... [id=broad-jade-ms/container.googleapis.com]
module.enable-services.google_project_service.required-services[14]: Refreshing state... [id=broad-jade-ms/stackdriver.googleapis.com]
module.enable-services.google_project_service.required-services[5]: Refreshing state... [id=broad-jade-ms/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[7]: Refreshing state... [id=broad-jade-ms/sql-component.googleapis.com]
module.enable-services.google_project_service.required-services[6]: Refreshing state... [id=broad-jade-ms/dns.googleapis.com]
module.enable-services.google_project_service.required-services[12]: Refreshing state... [id=broad-jade-ms/storage-component.googleapis.com]
module.core-infrastructure.google_compute_network.network[0]: Refreshing state... [id=projects/broad-jade-ms/global/networks/ms-network2]
module.core-infrastructure.google_compute_address.nat-address[1]: Refreshing state... [id=projects/broad-jade-ms/regions/us-central1/addresses/nat-external-1]
module.core-infrastructure.google_compute_address.nat-address[0]: Refreshing state... [id=projects/broad-jade-ms/regions/us-central1/addresses/nat-external-0]
module.core-infrastructure.google_compute_subnetwork.subnetwork[0]: Refreshing state... [id=projects/broad-jade-ms/regions/us-central1/subnetworks/ms-subnet2]
module.core-infrastructure.google_compute_router.router[0]: Refreshing state... [id=projects/broad-jade-ms/regions/us-central1/routers/router]
module.core-infrastructure.module.k8s-master.google_container_cluster.cluster: Refreshing state... [id=projects/broad-jade-ms/locations/us-central1/clusters/jade-master-us-central1]
module.core-infrastructure.google_compute_router_nat.nat[0]: Refreshing state... [id=broad-jade-ms/us-central1/router/nat-1]
module.core-infrastructure.module.k8s-nodes.google_container_node_pool.pool: Refreshing state... [id=projects/broad-jade-ms/locations/us-central1/clusters/jade-master-us-central1/nodePools/jade-node-us-central1]
module.datarepo-app.google_service_account.datarepo_sql_sa[0]: Refreshing state... [id=projects/broad-jade-ms/serviceAccounts/datarepo-jade-sql@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-app.module.workloadid.google_service_account.user-sql-service-account["ms"]: Refreshing state... [id=projects/broad-jade-ms/serviceAccounts/ms-workload-proxy-sa@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-app.module.cloudsql.google_compute_global_address.private_ip_address[0]: Refreshing state... [id=projects/broad-jade-ms/global/addresses/datarepo-db-jade-private-address]
module.datarepo-app.google_compute_global_address.global_ip_address: Refreshing state... [id=projects/broad-jade-ms/global/addresses/jade-ms-ip]
module.datarepo-app.google_service_account.datarepo_test_runner_sa[0]: Refreshing state... [id=projects/broad-jade-ms/serviceAccounts/datarepo-jade-test-runner@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-app.google_service_account.datarepo_api_sa[0]: Refreshing state... [id=projects/broad-jade-ms/serviceAccounts/datarepo-jade-api@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-app.module.workloadid.google_service_account_key.user-sql-sa-key["ms"]: Refreshing state... [id=projects/broad-jade-ms/serviceAccounts/ms-workload-proxy-sa@broad-jade-ms.iam.gserviceaccount.com/keys/0ccf93d5c87fd10131d268eb58927e4ab5ae579c]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[0]: Refreshing state... [id=broad-jade-ms/roles/container.admin/serviceaccount:datarepo-jade-test-runner@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[1]: Refreshing state... [id=broad-jade-ms/roles/logging.viewer/serviceaccount:datarepo-jade-test-runner@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-app.module.workloadid.google_service_account_iam_binding.sqlproxy_workload_identity_binding["ms"]: Refreshing state... [id=projects/broad-jade-ms/serviceAccounts/ms-workload-proxy-sa@broad-jade-ms.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.datarepo-app.module.workloadid.google_project_iam_member.user-sql-sa-role["ms"]: Refreshing state... [id=broad-jade-ms/roles/cloudsql.client/serviceaccount:ms-workload-proxy-sa@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-app.google_service_account_key.test_runner_sa_key[0]: Refreshing state... [id=projects/broad-jade-ms/serviceAccounts/datarepo-jade-test-runner@broad-jade-ms.iam.gserviceaccount.com/keys/95177f6c8b17e7582e993ca14148e4b51ea86637]
module.datarepo-app.google_service_account_key.sql_sa_key[0]: Refreshing state... [id=projects/broad-jade-ms/serviceAccounts/datarepo-jade-sql@broad-jade-ms.iam.gserviceaccount.com/keys/9cf1294cc7e19ca9bdf5d167f709bec725f1b26e]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[2]: Refreshing state... [id=broad-jade-ms/roles/monitoring.viewer/serviceaccount:datarepo-jade-test-runner@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.sql_sa_role[0]: Refreshing state... [id=broad-jade-ms/roles/cloudsql.client/serviceaccount:datarepo-jade-sql@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[3]: Refreshing state... [id=broad-jade-ms/roles/secretmanager.admin/serviceaccount:datarepo-jade-test-runner@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[7]: Refreshing state... [id=broad-jade-ms/roles/stackdriver.accounts.viewer/serviceaccount:datarepo-jade-api@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-app.google_service_account_key.api_sa_key[0]: Refreshing state... [id=projects/broad-jade-ms/serviceAccounts/datarepo-jade-api@broad-jade-ms.iam.gserviceaccount.com/keys/d1cedbd0c4673c2e4716a0994b24f8a1d0da465f]
module.datarepo-app.google_project_iam_member.api_sa_role[9]: Refreshing state... [id=broad-jade-ms/roles/pubsub.admin/serviceaccount:datarepo-jade-api@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[1]: Refreshing state... [id=broad-jade-ms/roles/cloudsql.admin/serviceaccount:datarepo-jade-api@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[11]: Refreshing state... [id=broad-jade-ms/roles/resourcemanager.projectIamAdmin/serviceaccount:datarepo-jade-api@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[10]: Refreshing state... [id=broad-jade-ms/roles/container.admin/serviceaccount:datarepo-jade-api@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[2]: Refreshing state... [id=broad-jade-ms/roles/datastore.user/serviceaccount:datarepo-jade-api@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[3]: Refreshing state... [id=broad-jade-ms/roles/errorreporting.writer/serviceaccount:datarepo-jade-api@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[0]: Refreshing state... [id=broad-jade-ms/roles/bigquery.admin/serviceaccount:datarepo-jade-api@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[4]: Refreshing state... [id=broad-jade-ms/roles/logging.logWriter/serviceaccount:datarepo-jade-api@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[5]: Refreshing state... [id=broad-jade-ms/roles/monitoring.admin/serviceaccount:datarepo-jade-api@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[6]: Refreshing state... [id=broad-jade-ms/roles/servicemanagement.serviceController/serviceaccount:datarepo-jade-api@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[8]: Refreshing state... [id=broad-jade-ms/roles/storage.admin/serviceaccount:datarepo-jade-api@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-app.module.cloudsql.google_service_networking_connection.private_vpc_connection[0]: Refreshing state... [id=https%3A%2F%2Fwww.googleapis.com%2Fcompute%2Fv1%2Fprojects%2Fbroad-jade-ms%2Fglobal%2Fnetworks%2Fms-network2:servicenetworking.googleapis.com]
module.datarepo-app.vault_generic_secret.sql_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/ms/datarepo-sql-sa]
module.datarepo-app.vault_generic_secret.test_runner_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/ms/test-runner-sa]
module.datarepo-app.vault_generic_secret.api_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/ms/datarepo-api-sa]
module.datarepo-app.module.cloudsql.google_sql_database_instance.cloudsql_instance[0]: Refreshing state... [id=datarepo-db-jade-e146914d2f4434c7]
module.datarepo-app.module.cloudsql.google_sql_database.app_database["datarepo"]: Refreshing state... [id=projects/broad-jade-ms/instances/datarepo-db-jade-e146914d2f4434c7/databases/datarepo]
module.datarepo-app.module.cloudsql.google_sql_database.app_database["datarepo-stairway"]: Refreshing state... [id=projects/broad-jade-ms/instances/datarepo-db-jade-e146914d2f4434c7/databases/stairway]
module.datarepo-app.module.cloudsql.google_sql_user.app_user["datarepo"]: Refreshing state... [id=drmanager//datarepo-db-jade-e146914d2f4434c7]
module.datarepo-app.module.cloudsql.google_sql_user.app_user["datarepo-stairway"]: Refreshing state... [id=drmanager//datarepo-db-jade-e146914d2f4434c7]
module.datarepo-app.module.cloudsql.google_sql_user.root_user[0]: Refreshing state... [id=root//datarepo-db-jade-e146914d2f4434c7]
module.datarepo-app.vault_generic_secret.sql_db_password[0]: Refreshing state... [id=secret/dsde/datarepo/ms/datarepo-sql-db]
module.datarepo-alerts.data.vault_generic_secret.slack_token: Refreshing state... [id=secret/suitable/terraform/stackdriver/slack-token]
module.datarepo-alerts.google_compute_global_address.global_ip_address_prometheus: Refreshing state... [id=projects/broad-jade-ms/global/addresses/datarepo-prometheus-ip]
module.datarepo-alerts.google_compute_global_address.global_ip_address_grafana: Refreshing state... [id=projects/broad-jade-ms/global/addresses/datarepo-grafana-ip]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account.service-account: Refreshing state... [id=projects/broad-jade-ms/serviceAccounts/prometheus-sa@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account_key.service-account-key: Refreshing state... [id=projects/broad-jade-ms/serviceAccounts/prometheus-sa@broad-jade-ms.iam.gserviceaccount.com/keys/6376f18103ba7f265e0b5872b9bdd9c54ee8f1ad]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/logging.admin"]: Refreshing state... [id=broad-jade-ms/roles/logging.admin/serviceaccount:prometheus-sa@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/monitoring.admin"]: Refreshing state... [id=broad-jade-ms/roles/monitoring.admin/serviceaccount:prometheus-sa@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/monitoring.metricWriter"]: Refreshing state... [id=broad-jade-ms/roles/monitoring.metricWriter/serviceaccount:prometheus-sa@broad-jade-ms.iam.gserviceaccount.com]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account_iam_binding.workload-identity-binding: Refreshing state... [id=projects/broad-jade-ms/serviceAccounts/prometheus-sa@broad-jade-ms.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.datarepo-alerts.data.vault_generic_secret.slack_token will be read during apply
  # (config refers to values not yet known)
 <= data "vault_generic_secret" "slack_token"  {
      ~ data             = (sensitive value)
      ~ data_json        = (sensitive value)
      ~ id               = "secret/suitable/terraform/stackdriver/slack-token" -> (known after apply)
      ~ lease_duration   = 2764800 -> (known after apply)
      + lease_id         = (known after apply)
      ~ lease_renewable  = false -> (known after apply)
      ~ lease_start_time = "RFC1010109" -> (known after apply)
        path             = "secret/suitable/terraform/stackdriver/slack-token"
      - version          = -1 -> null
    }

  # module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0] will be created
  + resource "google_monitoring_notification_channel" "notification_channel" {
      + display_name        = "ms"
      + enabled             = true
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + project             = (known after apply)
      + type                = "slack"
      + verification_status = (known after apply)
    }

  # module.datarepo-app.vault_generic_secret.api_sa_key[0] will be created
  + resource "vault_generic_secret" "api_sa_key" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/dsde/datarepo/ms/datarepo-api-sa"
    }

  # module.datarepo-app.vault_generic_secret.sql_db_password[0] will be created
  + resource "vault_generic_secret" "sql_db_password" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/dsde/datarepo/ms/datarepo-sql-db"
    }

  # module.datarepo-app.vault_generic_secret.sql_sa_key[0] will be created
  + resource "vault_generic_secret" "sql_sa_key" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/dsde/datarepo/ms/datarepo-sql-sa"
    }

  # module.datarepo-app.vault_generic_secret.test_runner_sa_key[0] will be created
  + resource "vault_generic_secret" "test_runner_sa_key" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/dsde/datarepo/ms/test-runner-sa"
    }

  # module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.node_resource_alerts will be created
  + resource "google_monitoring_alert_policy" "node_resource_alerts" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "k8s-node-resource-usage"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "broad-jade-ms"

      + conditions {
          + display_name = "node-cpu-utilization"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "metric.type=\"kubernetes.io/node/cpu/allocatable_utilization\" resource.type=\"k8s_node\" "
              + threshold_value = 0.95

              + aggregations {
                  + alignment_period     = "60s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + group_by_fields      = [
                      + "resource.labels.cluster_name",
                      + "resource.labels.node_name",
                    ]
                  + per_series_aligner   = "ALIGN_MEAN"
                }
            }
        }
      + conditions {
          + display_name = "node-memory-utilization"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "metric.type=\"kubernetes.io/node/memory/allocatable_utilization\" resource.type=\"k8s_node\" metric.label.\"memory_type\"=\"non-evictable\""
              + threshold_value = 0.95

              + aggregations {
                  + alignment_period     = "60s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + group_by_fields      = [
                      + "resource.labels.cluster_name",
                      + "resource.labels.node_name",
                    ]
                  + per_series_aligner   = "ALIGN_MEAN"
                }
            }
        }

      + documentation {
          + content   = "A cluster node has been running with high resource utilization for greater than 300seconds"
          + mime_type = "text/markdown"
        }
    }

  # module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_health_alert will be created
  + resource "google_monitoring_alert_policy" "pod_health_alert" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "k8s-container-health-status"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "broad-jade-ms"

      + conditions {
          + display_name = "container-frequent-restarts"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "600s"
              + filter          = "metric.type=\"kubernetes.io/container/restart_count\" resource.type=\"k8s_container\""
              + threshold_value = 0

              + aggregations {
                  + alignment_period     = "60s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + group_by_fields      = [
                      + "resource.labels.cluster_name",
                      + "resource.label.namespace_name",
                      + "resource.label.container_name",
                      + "resource.label.pod_name",
                    ]
                  + per_series_aligner   = "ALIGN_DELTA"
                }
            }
        }

      + documentation {
          + content   = "A container has been experiencing frequent restarts for greater than 5 minutes"
          + mime_type = "text/markdown"
        }
    }

  # module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_memory_util will be created
  + resource "google_monitoring_alert_policy" "pod_memory_util" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "k8s-pod-resource-utilization"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "broad-jade-ms"

      + conditions {
          + display_name = "pod-memory-limit-utilization"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "metric.type=\"kubernetes.io/container/memory/limit_utilization\" resource.type=\"k8s_container\" metric.label.\"memory_type\"=\"non-evictable\" resource.label.\"container_name\"!=\"metadata-proxy\""
              + threshold_value = 0.95

              + aggregations {
                  + alignment_period     = "60s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + group_by_fields      = [
                      + "resource.labels.cluster_name",
                      + "resource.label.namespace_name",
                      + "resource.label.pod_name",
                    ]
                  + per_series_aligner   = "ALIGN_MEAN"
                }
            }
        }
      + conditions {
          + display_name = "pod-volume-utilization"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "metric.type=\"kubernetes.io/pod/volume/utilization\" resource.type=\"k8s_pod\""
              + threshold_value = 0.95

              + aggregations {
                  + alignment_period     = "60s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + group_by_fields      = [
                      + "resource.labels.cluster_name",
                      + "resource.label.namespace_name",
                      + "resource.label.pod_name",
                      + "metric.label.volume_name",
                    ]
                  + per_series_aligner   = "ALIGN_MEAN"
                }
            }
        }
      + conditions {
          + display_name = "pod-cpu-limit-utilization"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "metric.type=\"kubernetes.io/container/cpu/limit_utilization\" resource.type=\"k8s_container\""
              + threshold_value = 0.95

              + aggregations {
                  + alignment_period     = "60s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + group_by_fields      = [
                      + "resource.labels.cluster_name",
                      + "resource.label.namespace_name",
                      + "resource.label.pod_name",
                      + "resource.label.container_name",
                    ]
                  + per_series_aligner   = "ALIGN_MEAN"
                }
            }
        }

      + documentation {
          + content   = "A pod has been requesting greater than 95% of a resource limit for longer than 5 minutes"
          + mime_type = "text/markdown"
        }
    }

  # module.datarepo-alerts.module.uptimecheck.google_monitoring_alert_policy.uptime-check[0] will be created
  + resource "google_monitoring_alert_policy" "uptime-check" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "uptime check failed for jade-ms.datarepo-ms.broadinstitute.org/"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "broad-jade-ms"

      + conditions {
          + display_name = "Uptime Health Check on jade-ms.datarepo-ms.broadinstitute.org"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "0s"
              + filter          = (known after apply)
              + threshold_value = 1

              + aggregations {
                  + alignment_period     = "1200s"
                  + cross_series_reducer = "REDUCE_COUNT_FALSE"
                  + group_by_fields      = [
                      + "resource.*",
                    ]
                  + per_series_aligner   = "ALIGN_NEXT_OLDER"
                }

              + trigger {
                  + count   = 1
                  + percent = 0
                }
            }
        }

      + documentation {
          + content   = "https://jade-ms.datarepo-ms.broadinstitute.org/"
          + mime_type = "text/markdown"
        }
    }

  # module.datarepo-alerts.module.uptimecheck.google_monitoring_uptime_check_config.uptime-check-config[0] will be created
  + resource "google_monitoring_uptime_check_config" "uptime-check-config" {
      + display_name     = "jade-ms.datarepo-ms.broadinstitute.org/"
      + id               = (known after apply)
      + name             = (known after apply)
      + period           = "900s"
      + project          = "broad-jade-ms"
      + selected_regions = [
          + "ASIA_PACIFIC",
          + "EUROPE",
          + "SOUTH_AMERICA",
          + "USA",
        ]
      + timeout          = "10s"
      + uptime_check_id  = (known after apply)

      + http_check {
          + headers        = (known after apply)
          + mask_headers   = false
          + path           = "/"
          + port           = 443
          + request_method = "GET"
          + use_ssl        = true
          + validate_ssl   = true
        }

      + monitored_resource {
          + labels = {
              + "host"       = "jade-ms.datarepo-ms.broadinstitute.org"
              + "project_id" = "broad-jade-ms"
            }
          + type   = "uptime_url"
        }

      + timeouts {}
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "bucket" but a value was
found in file "tfvars/ms.tfvars". To use this value, add a "variable" block to
the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.


Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/datarepo-app/modules/datarepo-app/cloudsql.tf line 24, in module "cloudsql":
  24:     "${local.service}" = {

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 5 more similar warnings elsewhere)


------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @smark88, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*